Revit 2027 API
DimensionSegment.Prefix Property
The text shown before the segment's value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Prefix { get; set; }
Public Property Prefix As String
	Get
	Set
public:
property String^ Prefix {
	String^ get ();
	void set (String^ value);
}
member Prefix : string with get, set
Property Value
String
See Also
Reference
DimensionSegment Class
Autodesk.Revit.DB Namespace